WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/meadow_timer_support.c
  syslog(1, "==> %s@%d-Creating timer experiment thread\n", __FILE__, __LINE__);

  // Create a thread to use for experimenting
  _meadow_timer_exp_thread = kthread_create(MEADOW_TIMER_EXPERIMENT_THREAD_NAME,
                                  MEADOW_TIMER_EXPERIMENT_THREAD_PRIORITY,
                                  MEADOW_TIMER_EXPERIMENT_THREAD_STACKSIZE,
                                  (main_t) _meadow_timer_thread_func,
                                  (char *const *) NULL);
  if (_meadow_timer_exp_thread <= 0)
  {
    syslog(LOG_ERR, "%s@%d-Creation of %s kthread FAILED\n",
              __FILE__, __LINE__, MEADOW_TIMER_EXPERIMENT_THREAD_NAME);
    return -ENOEXEC;
  }

  return OK;
}

//========================================================
// New thread for running tests
void *_meadow_timer_thread_func(int argc, char *argv[])
{
  int ret;
  
// #if HCOM_DIAG_OUTPUT_SYSLOG_PID_OF_NEW_THREADS > 0
  syslog(2, "New kthread [PID:%d],'%s'\n", getpid(), MEADOW_TIMER_EXPERIMENT_THREAD_NAME);
  usleep(10 * 1000);  
// #endif

  sem_init(&_endCountSem, 0, 0);
  sem_setprotocol(&_endCountSem, SEM_PRIO_NONE);

  // General timer initialization
  syslog(1, "--> Setting up general timer init\n");
  struct timerInfo_s *timerInfo = meadow_timer_init_general(MEADOW_TIMER_EXPERIMENT_NUMBER);
  if(timerInfo == NULL)
  {
    syslog(LOG_ERR, "%s@%d-Meadow timer init failed\n", __FILE__, __LINE__);
    return NULL;
  }

  syslog(1, "--> Pulse width initialization\n");
  ret = meadow_timer_init_gated_pulse_width(timerInfo);
  if(ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-Meadow pulsh width init failed:%d\n", __FILE__, __LINE__, ret);
    return NULL;
  }
  
  // Final initialization
  syslog(1, "--> Enabling timer\n");
  meadow_timer_enable(timerInfo);

  syslog(1, "--> Configuration complete, entering main loop\n");
  usleep(2000 * 1000);

  // -------------------------------------------------------------------------
  // Attempt to simulate normal operation via this loop
  while(true)
  {
    // Clear all timer counter's
    if(timerInfo->timerWidth == 16)
      putreg16(0, timerInfo->timerBase + STM32_GTIM_CNT_OFFSET);
    else
      putreg32(0, timerInfo->timerBase + STM32_GTIM_CNT_OFFSET);
    
    timerInfo->timerOvrFlow = 0;

    syslog(1, "==> Timer %u sending pulse to HC-SR04\n", timerInfo->timerNumb);
    // Send pulse to HC-SR04, this must be at least 2us wide to signal the
    // HC-SR04 to send ultrasonic pulses and wait for the echo.
    stm32_gpiowrite(MEADOW_TIMER_TEST_GPIO_D15_OUT, true);

    // Insure pulse is at least 2 usec
    // for(int i = 0; i < 1800; i++);

    // Note a 1-2 ms pulse works too. HC-SR04 is pretty forgiving. Pulse is
    // generated by falling edge (I THINK)
    usleep(1);

    stm32_gpiowrite(MEADOW_TIMER_TEST_GPIO_D15_OUT, false);
    int semcount;
    ret = sem_getvalue(&_endCountSem, &semcount);
    syslog(1, "==> Pulse sent to HC-SR04. WAIT for semaphore, semCount:%d.\n", semcount);

    // Wait for ISR to indicate that timer has ended
    // Note: There are times when the HC-SR04 ends the timing pulse but the F7
    // doesn't send the TIF interrupt to indicate that the end was detected???
    // This only happens when UIF overflow count is involved but only with

    struct timespec abstime;
    ret = clock_gettime(CLOCK_REALTIME, &abstime);
    abstime.tv_sec += 2;    // This delay should be supplied by user
    abstime.tv_nsec = 0;
    int ret = sem_timedwait(&_endCountSem, &abstime);
    if(ret < 0)
    {
      if(ret == ETIMEDOUT)
      {
        syslog(1, "--> ERROR:Semaphore timeout,ret:%d, errno:%d\n", ret, errno); 
      }
      else
      {
        syslog(1, "--> ERROR:Semaphore ret:%d, errno:%d\n", ret, errno); 
      }
    }
    else
    {
      syslog(1, "--> ISR indicates counting complete\n"); 
    }

    // meadow_timer_support_wait_sem(&_endCountSem);

    // Get the counter value
    syslog(1, "----> Raw data - timerWidth:%u timerCount:%lu, timerOvrFlow:%lu\n",
              timerInfo->timerWidth, timerInfo->timerCount, timerInfo->timerOvrFlow);

    uint64_t cntValue;
    if(timerInfo->timerWidth == 16)
      cntValue = timerInfo->timerCount + (timerInfo->timerOvrFlow * 0xffff);
    else 
      cntValue = timerInfo->timerCount + (timerInfo->timerOvrFlow * 0xffffffff);

    if(cntValue > 0)
    {
      // Temperature effects speed of sound. At 20 degrees C = 343.21 M/Sec at 25 = 346.13
      long double totalTime = (long double)cntValue / (long double)timerInfo->timerClkFreq;
      long double oneWayTime = totalTime/2.0;
      long double distance = oneWayTime /*seconds*/ * 345; /* meters/second*/
      syslog(1, "=====> Count:%lu, Time:%10.8fms, Distance:%1.6fm\n",
                cntValue, oneWayTime * 1000, distance);
    }
    else
    {
      syslog(1, "--> Timer %u count was %lu\n", timerInfo->timerNumb, cntValue);
    }

    // In the FUTURE - wait for trigger request here, not usleep.
    syslog(1, "--> Timer %d waiting 1 second to simulate trigger request\n\n", timerInfo->timerNumb);
    sleep(1);   // Temporary
  }

  return NULL;    // Keep compiler happy
}

//=============================================================
// Scheme from stm32_tim.c stm32_tim_disable()
void meadow_timer_disable(struct timerInfo_s *timerInfo)
{
  uint32_t timerBase = timerInfo->timerBase;

  uint16_t regval = getreg16(timerBase + STM32_BTIM_CR1_OFFSET);
  regval &= ~ATIM_CR1_CEN;
  putreg16(regval, timerBase + STM32_BTIM_CR1_OFFSET);
}

//=============================================================
// Scheme from stm32_tim.c stm32_tim_enable()
void meadow_timer_enable(struct timerInfo_s *timerInfo)
{
  uint32_t timerBase = timerInfo->timerBase;

  // Why this order? tryed to copy the NUTTX order
  uint16_t cr1Val = getreg16(timerBase + STM32_GTIM_CR1_OFFSET);
  cr1Val |= GTIM_CR1_CEN;
  uint16_t egrVal = getreg16(timerBase + STM32_GTIM_EGR_OFFSET);
  egrVal |= GTIM_EGR_UG;
  putreg16(egrVal, timerBase + STM32_GTIM_EGR_OFFSET);
  putreg16(cr1Val, timerBase + STM32_GTIM_CR1_OFFSET);
}

